<a href="https://colab.research.google.com/github/xhailu/hello/blob/main/DataFrames_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [5]:
  import pandas as pd

In [14]:
foods = pd.read_csv("/content/drive/MyDrive/pandas_bor/foods.csv")
nba = pd.read_csv("/content/drive/MyDrive/pandas_bor/nba.csv")
rev = pd.read_csv("/content/drive/MyDrive/pandas_bor/revenue.csv")

## Shared Methods and Attributes

#head()    and tail()  methods of  dataframe

In [7]:
foods.head(1)

  First Name  Gender      City Frequency    Item  Spend
0      Wanda  Female  Stamford    Weekly  Burger  15.66

In [ ]:
foods.tail()

    First Name  Gender          City Frequency     Item  Spend
995      Donna  Female      New York   Monthly    Sushi  83.53
996     Albert    Male  Philadelphia     Daily    Sushi  72.88
997       Jean  Female      Stamford    Weekly    Donut   5.85
998    Jessica  Female      New York     Daily  Chalupa  43.19
999      Brian    Male      New York     Daily  Chalupa  28.36

# index,values,shape,dtypes,columns,axes,info  properties of dataframe

In [ ]:
foods.index

RangeIndex(start=0, stop=1000, step=1)

In [ ]:
foods.values

array([['Wanda', 'Female', 'Stamford', 'Weekly', 'Burger', 15.66],
       ['Eric', 'Male', 'Stamford', 'Daily', 'Chalupa', 10.56],
       ['Charles', 'Male', 'New York', 'Never', 'Sushi', 42.14],
       ...,
       ['Jean', 'Female', 'Stamford', 'Weekly', 'Donut', 5.85],
       ['Jessica', 'Female', 'New York', 'Daily', 'Chalupa', 43.19],
       ['Brian', 'Male', 'New York', 'Daily', 'Chalupa', 28.36]],
      dtype=object)

In [ ]:
foods.shape

(1000, 6)

In [ ]:
foods.dtypes

First Name     object
Gender         object
City           object
Frequency      object
Item           object
Spend         float64
dtype: object

In [ ]:
foods.head()

  First Name  Gender          City Frequency       Item  Spend
0      Wanda  Female      Stamford    Weekly     Burger  15.66
1       Eric    Male      Stamford     Daily    Chalupa  10.56
2    Charles    Male      New York     Never      Sushi  42.14
3       Anna  Female  Philadelphia      Once  Ice Cream  11.01
4    Deborah  Female  Philadelphia     Daily    Chalupa  23.49

In [ ]:
foods.columns

Index(['First Name', 'Gender', 'City', 'Frequency', 'Item', 'Spend'], dtype='object')

In [ ]:
foods.axes

[RangeIndex(start=0, stop=1000, step=1),
 Index(['First Name', 'Gender', 'City', 'Frequency', 'Item', 'Spend'], dtype='object')]

In [ ]:
foods.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  1000 non-null   object
 1   Gender      1000 non-null   object
 2   City        1000 non-null   object
 3   Frequency   1000 non-null   object
 4   Item        1000 non-null   object
 5   Spend       1000 non-null   float64
dtypes: float64(1), object(5)
memory usage: 47.0+ KB

In [ ]:
s = pd.Series([1, 2, 3])
s.sum()

6

#Sum horizontally  using  sum(axis="columns")

In [17]:
rev.sum(axis = "columns")

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  """Entry point for launching an IPython kernel.

0    1606
1    2060
2     967
3    2519
4     438
5    1935
6    1234
7    2313
8    2623
9     555
dtype: int64

In [18]:
rev.sum(axis=1)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  """Entry point for launching an IPython kernel.

0    1606
1    2060
2     967
3    2519
4     438
5    1935
6    1234
7    2313
8    2623
9     555
dtype: int64

## Select One Column from a `DataFrame`

In [ ]:
#nba = pd.read_csv("nba.csv")
nba[["Team"]].head(3)

             Team
0  Boston Celtics
1  Boston Celtics
2  Boston Celtics

## Select Two or More Columns from A `DataFrame`

In [12]:
#nba = pd.read_csv("nba.csv")
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [ ]:
nba[["Team", "Name"]].head(3)
nba[["Number", "College"]]
nba[["Salary", "Team", "Name"]].tail()

        Salary       Team          Name
453  2433333.0  Utah Jazz  Shelvin Mack
454   900000.0  Utah Jazz     Raul Neto
455  2900000.0  Utah Jazz  Tibor Pleiss
456   947276.0  Utah Jazz   Jeff Withey
457        NaN        NaN           NaN

In [ ]:
select = ["Salary", "Team", "Name"]
nba[select].head(3)

      Salary            Team           Name
0  7730337.0  Boston Celtics  Avery Bradley
1  6796117.0  Boston Celtics    Jae Crowder
2        NaN  Boston Celtics   John Holland

## Add New Column to `DataFrame`

In [ ]:
#nba = pd.read_csv("nba.csv")
nba.head(3)

nba["Sport"] = "Basketball"
nba.head(3)

nba["League"] = "National Basketball Association"
nba.head(3)

            Name            Team  ...       Sport                           League
0  Avery Bradley  Boston Celtics  ...  Basketball  National Basketball Association
1    Jae Crowder  Boston Celtics  ...  Basketball  National Basketball Association
2   John Holland  Boston Celtics  ...  Basketball  National Basketball Association

[3 rows x 11 columns]

## Broadcasting Operations

In [ ]:
#nba = pd.read_csv("nba.csv")
nba.head(3)

            Name            Team  ...  Weight in Kilograms Salary in Millions
0  Avery Bradley  Boston Celtics  ...             81.64656           7.730337
1    Jae Crowder  Boston Celtics  ...            106.59412           6.796117
2   John Holland  Boston Celtics  ...             92.98636                NaN

[3 rows x 13 columns]

In [ ]:
nba["Age"].add(5)
nba["Age"] + 5

nba["Salary"].sub(5000000)
nba["Salary"] - 5000000

nba["Weight"].mul(0.453592)
nba["Weight in Kilograms"] = nba["Weight"] * 0.453592

In [ ]:
nba= pd.read_csv("/content/drive/MyDrive/pandas_bor/nba.csv")
nba.head(3)

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN

[3 rows x 9 columns]

In [ ]:
nba["Salary"].div(1000000)
nba["Salary in Millions"] = nba["Salary"] / 1000000

In [ ]:
nba.head(3)

            Name            Team  ...     Salary Salary in Millions
0  Avery Bradley  Boston Celtics  ...  7730337.0           7.730337
1    Jae Crowder  Boston Celtics  ...  6796117.0           6.796117
2   John Holland  Boston Celtics  ...        NaN                NaN

[3 rows x 10 columns]

## A Review of the `.value_counts()` Method

In [ ]:
nba= pd.read_csv("/content/drive/MyDrive/pandas_bor/nba.csv")
nba.head(3)

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN

[3 rows x 9 columns]

In [ ]:
nba["Team"].value_counts()
nba["Position"].value_counts().head(1)
nba["Weight"].value_counts().tail()
nba["Salary"].value_counts()

947276.0     31
845059.0     18
525093.0     13
981348.0      6
1100602.0     5
             ..
1242720.0     1
2489530.0     1
5103120.0     1
9463484.0     1
700902.0      1
Name: Salary, Length: 309, dtype: int64

## Drop Rows with Null Values

In [ ]:
nba= pd.read_csv("/content/drive/MyDrive/pandas_bor/nba.csv")
nba.head(3)

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN

[3 rows x 9 columns]

In [ ]:
nba.tail(3)

             Name       Team  Number Position  ...  Height Weight  College     Salary
455  Tibor Pleiss  Utah Jazz    21.0        C  ...     7-3  256.0      NaN  2900000.0
456   Jeff Withey  Utah Jazz    24.0        C  ...     7-0  231.0   Kansas   947276.0
457           NaN        NaN     NaN      NaN  ...     NaN    NaN      NaN        NaN

[3 rows x 9 columns]

In [ ]:
nba.dropna(how = "all", inplace = True)

In [ ]:
nba.tail(3)

             Name       Team  Number Position  ...  Height Weight  College     Salary
454     Raul Neto  Utah Jazz    25.0       PG  ...     6-1  179.0      NaN   900000.0
455  Tibor Pleiss  Utah Jazz    21.0        C  ...     7-3  256.0      NaN  2900000.0
456   Jeff Withey  Utah Jazz    24.0        C  ...     7-0  231.0   Kansas   947276.0

[3 rows x 9 columns]

In [ ]:
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [ ]:
nba.dropna(subset = ["Salary", "College"])

              Name            Team  Number  ... Weight        College     Salary
0    Avery Bradley  Boston Celtics     0.0  ...  180.0          Texas  7730337.0
1      Jae Crowder  Boston Celtics    99.0  ...  235.0      Marquette  6796117.0
3      R.J. Hunter  Boston Celtics    28.0  ...  185.0  Georgia State  1148640.0
6    Jordan Mickey  Boston Celtics    55.0  ...  235.0            LSU  1170960.0
7     Kelly Olynyk  Boston Celtics    41.0  ...  238.0        Gonzaga  2165160.0
..             ...             ...     ...  ...    ...            ...        ...
449    Rodney Hood       Utah Jazz     5.0  ...  206.0           Duke  1348440.0
451  Chris Johnson       Utah Jazz    23.0  ...  206.0         Dayton   981348.0
452     Trey Lyles       Utah Jazz    41.0  ...  234.0       Kentucky  2239800.0
453   Shelvin Mack       Utah Jazz     8.0  ...  203.0         Butler  2433333.0
456    Jeff Withey       Utah Jazz    24.0  ...  231.0         Kansas   947276.0

[364 rows x 9 columns]

## Fill in Null Values with the `.fillna()` Method

In [ ]:
nba= pd.read_csv("/content/drive/MyDrive/pandas_bor/nba.csv")
nba.head(3)

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN

[3 rows x 9 columns]

In [ ]:
nba.fillna(0)

              Name            Team  ...            College     Salary
0    Avery Bradley  Boston Celtics  ...              Texas  7730337.0
1      Jae Crowder  Boston Celtics  ...          Marquette  6796117.0
2     John Holland  Boston Celtics  ...  Boston University        0.0
3      R.J. Hunter  Boston Celtics  ...      Georgia State  1148640.0
4    Jonas Jerebko  Boston Celtics  ...                  0  5000000.0
..             ...             ...  ...                ...        ...
453   Shelvin Mack       Utah Jazz  ...             Butler  2433333.0
454      Raul Neto       Utah Jazz  ...                  0   900000.0
455   Tibor Pleiss       Utah Jazz  ...                  0  2900000.0
456    Jeff Withey       Utah Jazz  ...             Kansas   947276.0
457              0               0  ...                  0        0.0

[458 rows x 9 columns]

In [ ]:
nba["Salary"].fillna(0, inplace = True)

In [ ]:
nba.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

In [ ]:
nba["College"].fillna("No College", inplace = True)

In [ ]:
nba.head()

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0         No College  5000000.0

[5 rows x 9 columns]

## The `.astype()` Method

In [ ]:
nba = pd.read_csv("/content/drive/MyDrive/pandas_bor/nba.csv").dropna(how = "all")
nba["Salary"].fillna(0, inplace = True)
nba["College"].fillna("None", inplace = True)
nba.head(6)

            Name            Team  Number  ... Weight            College      Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas   7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette   6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University         0.0
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State   1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0               None   5000000.0
5   Amir Johnson  Boston Celtics    90.0  ...  240.0               None  12000000.0

[6 rows x 9 columns]

In [ ]:
nba.dtypes
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   458 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [ ]:
nba["Salary"] = nba["Salary"].astype("int")

In [ ]:
nba.head(3)

In [ ]:
nba["Number"] = nba["Number"].astype("int")
nba["Age"] = nba["Age"].astype("int")
nba.head(3)

In [ ]:
nba["Age"].astype("float")

In [ ]:
nba["Position"].nunique()

In [ ]:
nba["Position"] = nba["Position"].astype("category")

In [ ]:
nba["Team"] = nba["Team"].astype("category")

In [ ]:
nba.head()

## Sort a `DataFrame` with the `.sort_values()` Method, Part I

In [ ]:
nba=pd.read_csv("/content/drive/MyDrive/pandas_bor/nba.csv")
nba.head(3)

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN

[3 rows x 9 columns]

In [ ]:
nba.sort_values("Name", ascending = False)

nba.sort_values("Age", ascending = False)

nba.sort_values("Salary", ascending = False, inplace = True)
nba.head(3)

                Name                 Team  Number  ... Weight   College    Salary
109      Kobe Bryant   Los Angeles Lakers    24.0  ...  212.0      None  25000000
169     LeBron James  Cleveland Cavaliers    23.0  ...  250.0      None  22970500
33   Carmelo Anthony      New York Knicks     7.0  ...  240.0  Syracuse  22875000

[3 rows x 9 columns]

In [ ]:
nba.sort_values("Salary", ascending = False, na_position = "first").tail()

               Name                    Team  ...       College Salary
353   Dorell Wright              Miami Heat  ...          None      0
264   Jordan Farmar       Memphis Grizzlies  ...          UCLA      0
409      Greg Smith  Minnesota Timberwolves  ...  Fresno State      0
273  Alex Stepheson       Memphis Grizzlies  ...           USC      0
270  Xavier Munford       Memphis Grizzlies  ...  Rhode Island      0

[5 rows x 9 columns]

## Sort a `DataFrame` with the `.sort_values()` Method, Part II

In [ ]:
nba=pd.read_csv("/content/drive/MyDrive/pandas_bor/nba.csv")
nba.head(3)

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN

[3 rows x 9 columns]

In [ ]:
nba.sort_values(["Team", "Name"], ascending = [True, False], inplace = True)
nba.head(3)

                 Name           Team  Number  ... Weight   College     Salary
322    Walter Tavares  Atlanta Hawks    22.0  ...  260.0       NaN  1000000.0
310  Tim Hardaway Jr.  Atlanta Hawks    10.0  ...  205.0  Michigan  1304520.0
321    Tiago Splitter  Atlanta Hawks    11.0  ...  245.0       NaN  9756250.0

[3 rows x 9 columns]

## Sort `DataFrame` with the `.sort_index()` Method

In [ ]:
nba=pd.read_csv("/content/drive/MyDrive/pandas_bor/nba.csv")
nba.head(3)

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN

[3 rows x 9 columns]

In [ ]:
nba.sort_values(["Number", "Salary", "Name"], inplace = True)
nba.tail(3)

               Name             Team  Number  ... Weight    College     Salary
68   Lucas Nogueira  Toronto Raptors    92.0  ...  220.0        NaN  1842000.0
1       Jae Crowder   Boston Celtics    99.0  ...  235.0  Marquette  6796117.0
457             NaN              NaN     NaN  ...    NaN        NaN        NaN

[3 rows x 9 columns]

In [ ]:
nba.sort_index(ascending = False, inplace = True)

In [ ]:
nba.head(3)

             Name       Team  Number Position  ...  Height Weight  College     Salary
457           NaN        NaN     NaN      NaN  ...     NaN    NaN      NaN        NaN
456   Jeff Withey  Utah Jazz    24.0        C  ...     7-0  231.0   Kansas   947276.0
455  Tibor Pleiss  Utah Jazz    21.0        C  ...     7-3  256.0      NaN  2900000.0

[3 rows x 9 columns]

## Rank Values with the `.rank()` Method

In [ ]:
nba=pd.read_csv("/content/drive/MyDrive/pandas_bor/nba.csv")
nba["Salary"] = nba["Salary"].fillna(0).astype("int")
nba.head(3)

            Name            Team  Number  ... Weight            College   Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        0

[3 rows x 9 columns]

In [ ]:
nba["Salary Rank"] = nba["Salary"].rank(ascending = False).astype("int")
nba.head(3)

            Name            Team  ...   Salary Salary Rank
0  Avery Bradley  Boston Celtics  ...  7730337          97
1    Jae Crowder  Boston Celtics  ...  6796117         110
2   John Holland  Boston Celtics  ...        0         452

[3 rows x 10 columns]

In [ ]:
nba.sort_values(by = "Salary", ascending = False)

                Name                    Team  ...    Salary Salary Rank
109      Kobe Bryant      Los Angeles Lakers  ...  25000000           1
169     LeBron James     Cleveland Cavaliers  ...  22970500           2
33   Carmelo Anthony         New York Knicks  ...  22875000           3
251    Dwight Howard         Houston Rockets  ...  22359364           4
339       Chris Bosh              Miami Heat  ...  22192730           5
..               ...                     ...  ...       ...         ...
269     Ray McCallum       Memphis Grizzlies  ...         0         452
409       Greg Smith  Minnesota Timberwolves  ...         0         452
2       John Holland          Boston Celtics  ...         0         452
264    Jordan Farmar       Memphis Grizzlies  ...         0         452
457              NaN                     NaN  ...         0         452

[458 rows x 10 columns]